q1.Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
l=[4,8,15,16,23,42]

In [6]:
pd.Series(l,index=['a','b','c','d','e','f'])

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
l=list(range(10))

In [9]:
l

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [10]:
pd.Series(l)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [27]:
df1=pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})

In [28]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional tabular data structure that consists of rows and columns. It can be thought of as a spreadsheet or a SQL table. Each column in a DataFrame represents a variable, and each row represents an observation.

On the other hand, a pandas Series is a one-dimensional labeled array that can hold data of any type. It is similar to a column in a DataFrame, but it does not have column names. Each element in a Series is associated with an index that allows for easy and efficient data access.

In [12]:
# examples
data = {'Name': ['daksh', 'dev', 'raghav'],
        'Age': [25, 30, 35],
        'Country': ['USA', 'Canada', 'UK']}
df = pd.DataFrame(data)
print(df)

     Name  Age Country
0   daksh   25     USA
1     dev   30  Canada
2  raghav   35      UK

In [13]:
ages = pd.Series([25, 30, 35])
print(ages)

0    25
1    30
2    35
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [14]:
# examples
data = {'Name': ['daksh', 'dev', 'raghav'],
        'Age': [25, 30, 35],
        'Country': ['USA', 'Canada', 'UK']}
df = pd.DataFrame(data)
print(df)

     Name  Age Country
0   daksh   25     USA
1     dev   30  Canada
2  raghav   35      UK

In [15]:
# some common functions
df.head(2)

    Name  Age Country
0  daksh   25     USA
1    dev   30  Canada

In [16]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [29]:
g=df1.groupby('Gender')

In [30]:
g.sum()

        Age
Gender
Female   52
Male     30

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


Among the options provided, the mutable nature applies to the DataFrame in pandas.

A DataFrame is mutable, which means it can be modified after creation. You can add, delete, or modify columns, rows, or individual values within a DataFrame. These modifications can include changing column names, adding new columns, removing columns, updating values, or reordering the rows, among other operations.

On the other hand, both Series and Panel are immutable in nature.

A Series is an immutable data structure in pandas. Once a Series is created, its elements and index cannot be modified. However, you can create a new Series by performing operations on the existing Series.

A Panel, which is a three-dimensional data structure in pandas, is also immutable. Once a Panel is created, its items, major axis, minor axis, and the values within cannot be modified directly. Similar to Series, you can create a new Panel by applying transformations or operations on the original Panel.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
names = pd.Series(['daksh', 'dev', 'raghav'])
ages = pd.Series([25, 30, 35])
countries = pd.Series(['india', 'Canada', 'UK'])
df2=pd.DataFrame({"Name":names,"Age":ages,"Country":countries})

In [35]:
df2

     Name  Age Country
0   daksh   25   india
1     dev   30  Canada
2  raghav   35      UK